app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)
		@post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["body", "deneme"], ["created_at", "2018-05-19 13:03:36.862743"], ["updated_at", "2018-05-19 13:03:36.862743"]]